Merging, Joining and Concatination

In [56]:
import pandas as pd
import numpy as np

Merging 2 Dataframes

In [57]:
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name' : ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR'],
})

salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [50000, 60000, 70000, 80000, 90000],
    'bonus': [5000, 6000, 7000, 8000, 9000]
})

In [58]:
employees

   employee_id   name Department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [59]:
salaries

   employee_id  salary  bonus
0            1   50000   5000
1            2   60000   6000
2            3   70000   7000
3            6   80000   8000
4            7   90000   9000

Merging 2 Dataframes with employee_id as the key and inner join (default join type to keep only matching records only)

In [60]:
pd.merge(employees,salaries,on='employee_id', how='inner')

   employee_id   name Department  salary  bonus
0            1   John         HR   50000   5000
1            2   Anna         IT   60000   6000
2            3  Peter    Finance   70000   7000

Merging 2 Dataframes with employee_id as the key and outer join (it includes all records from both dataframes)

In [61]:
pd.merge(employees,salaries,on='employee_id', how='outer')

   employee_id   name Department   salary   bonus
0            1   John         HR  50000.0  5000.0
1            2   Anna         IT  60000.0  6000.0
2            3  Peter    Finance  70000.0  7000.0
3            4  Linda         IT      NaN     NaN
4            5    Bob         HR      NaN     NaN
5            6    NaN        NaN  80000.0  8000.0
6            7    NaN        NaN  90000.0  9000.0

Left Join will keep all records from the left DataFrame (employees) and match with the right DataFrame (salaries)

In [62]:
pd.merge(employees,salaries,on='employee_id', how='left')

   employee_id   name Department   salary   bonus
0            1   John         HR  50000.0  5000.0
1            2   Anna         IT  60000.0  6000.0
2            3  Peter    Finance  70000.0  7000.0
3            4  Linda         IT      NaN     NaN
4            5    Bob         HR      NaN     NaN

Right join will include all records from the right DataFrame (salaries) and matched records from the left DataFrame (employees).

In [63]:

pd.merge(employees,salaries,on='employee_id', how='right')

   employee_id   name Department  salary  bonus
0            1   John         HR   50000   5000
1            2   Anna         IT   60000   6000
2            3  Peter    Finance   70000   7000
3            6    NaN        NaN   80000   8000
4            7    NaN        NaN   90000   9000

Concatination of 2 DataFrames

In [64]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})

In [65]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [66]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [67]:
pd.concat([df1, df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [68]:
pd.concat([df1, df2],axis=1) # Concatenating along Rows

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

Joining 2 Dataframes

In [69]:
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second DataFrame
df2 = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[2, 3, 4])

In [70]:
df1

      name
1    Alice
2      Bob
3  Charlie

In [71]:
df2

   score
2     85
3     90
4     75

In [72]:
df1.join(df2)  # Joining on index values but not on columns

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0

In [73]:
df1.join(df2,how='outer')  # Outer join on index values

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0

In [74]:
df2.join(df1)

   score     name
2     85      Bob
3     90  Charlie
4     75      NaN

In [75]:
df2.join(df1, how='outer')  # Outer join on index values, reversed order

   score     name
1    NaN    Alice
2   85.0      Bob
3   90.0  Charlie
4   75.0      NaN

Group By Aggregation

In [76]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df = pd.DataFrame(data)

In [77]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [78]:
#Group by Category and Calculate total num of sales
cat = df.groupby('Category')['Sales'].sum()
cat

Category
A    570
B    930
Name: Sales, dtype: int64

In [79]:
#Group by Store and Calculate total num of sales
store = df.groupby("Store")['Sales'].sum()
store

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [80]:
#Group by multiple column 
#Goup by Category and Store and Calculate total num of sales
store = df.groupby(['Category', "Store"])['Sales'].sum()
store

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

Aggregation

In [81]:
df['Sales'].mean()
#median mode min max std count

187.5

In [82]:
df["Sales"].median()

190.0

In [83]:
df["Sales"].mode()

0    200
Name: Sales, dtype: int64

In [84]:
df['Sales'].min()

100

In [85]:
df['Sales'].max()

300

In [86]:
df['Sales'].std()

66.06274074155351

In [87]:
df['Sales'].count()

8

In [88]:
df['Sales'].agg(['sum', 'mean', 'max', 'min', 'std', 'count', 'median'])  # Aggregating multiple statistics

sum       1500.000000
mean       187.500000
max        300.000000
min        100.000000
std         66.062741
count        8.000000
median     190.000000
Name: Sales, dtype: float64

Pivot Tables

In [89]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    286     88   John  January      Q1
1  2023-01-02       B   West    317     30   Mary  January      Q1
2  2023-01-03       C  North    829     90    Bob  January      Q1
3  2023-01-04       D  South    175     66  Alice  January      Q1
4  2023-01-05       A   East    845     35   John  January      Q1
5  2023-01-06       B   West    141     87   Mary  January      Q1
6  2023-01-07       C  North    775     32    Bob  January      Q1
7  2023-01-08       D  South    973     40  Alice  January      Q1
8  2023-01-09       A   East    488     32   John  January      Q1
9  2023-01-10       B   West    442     29   Mary  January      Q1
10 2023-01-11       C  North    599     67    Bob  January      Q1
11 2023-01-12       D  South    573     52  Alice  January      Q1
12 2023-01-13       A   East    663     78   John  January      Q1
13 2023-01-14       B   West    439     77   Mary  January      Q1
14 2023-01-15       C  North    381     49    Bob  January      Q1
15 2023-01-16       D  South    514     21  Alice  January      Q1
16 2023-01-17       A   East    463     38   John  January      Q1
17 2023-01-18       B   West    924     81   Mary  January      Q1
18 2023-01-19       C  North    364     68    Bob  January      Q1
19 2023-01-20       D  South    726     94  Alice  January      Q1

In [90]:
pivot1 = pd.pivot_table(df,values='Sales', index="Region", columns='Product', aggfunc='median') #Creating a pivot table to summarize sales by region and product
pivot1

Product      A      B      C      D
Region
East     488.0    NaN    NaN    NaN
North      NaN    NaN  599.0    NaN
South      NaN    NaN    NaN  573.0
West       NaN  439.0    NaN    NaN

In [91]:
Pivot2 = pd.pivot_table(df,values=['Sales','Units'], index="Region", columns='Product') #Creating a pivot table to summarize sales by region and product
Pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     549.0    NaN    NaN    NaN  54.2   NaN   NaN   NaN
North      NaN    NaN  589.6    NaN   NaN   NaN  61.2   NaN
South      NaN    NaN    NaN  592.2   NaN   NaN   NaN  54.6
West       NaN  452.6    NaN    NaN   NaN  60.8   NaN   NaN

Cross Tabs

In [92]:
pd.crosstab(df['Region'], df['Product'])  # Creating a cross-tabulation of sales by region and product

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

Operations

In [93]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [94]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

Dataframe Basic Operations

In [95]:
df1.shape

(5, 3)

In [96]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [97]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [98]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [99]:
df1['A'] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

Dataframes Applying Function

In [100]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [101]:
def square(x):
    return x ** 2

In [104]:
# df1["D"] = df1["B"].apply(square)  # Applying the square function to column 'B'
df1["D"] = df1["B"].apply(lambda x: x ** 2)  # Applying a lambda function to square the values in column 'B'

In [105]:
df1

   A   B    C     D
0  1  10  100   100
1  2  20  200   400
2  3  30  300   900
3  4  40  400  1600
4  5  50  500  2500